# Создайте функцию, которая определяет, может ли c каждого места в концертном заде видеть сцену. С места можно увидеть
# сцену, если значение этого места (указано во входном списке) строго больше, чем значение перед ним.
# Каждый может увидеть сцену в примере ниже:
# [[1, 2, 3, 2, 1, 1],  [2, 4, 4, 3, 2, 2],  [5, 5, 5, 5, 4, 4],  [6, 6, 7, 6, 5, 5]]
# Не все видят сцену:
# [[1, 2, 3, 2, 1, 1],    [2, 4, 4, 3, 2, 2],    [5, 5, 5, 10, 4, 4],    [6, 6, 7, 6, 5, 5]]
# Функция должна возвращать True, если абсолютно все видят сцену, иначе False

def isVisible(list: list) -> bool:
    i = 0
    while i < len(list):
        k = 0
        if i == len(list) - 1:
            break
        for item in list[i]:
            if item > list[i + 1][k]:
                return False
            k += 1
        i += 1
    return True


print(isVisible([[1, 2, 3, 2, 1, 1], [2, 4, 4, 3, 2, 2], [5, 5, 5, 5, 4, 4], [6, 6, 7, 6, 5, 5]]))
print(isVisible([[1, 2, 3, 2, 1, 1], [2, 4, 4, 3, 2, 2], [5, 5, 5, 10, 4, 4], [6, 6, 7, 6, 5, 5]]))